package org.shaobig.ralph.generate_alphabet.repository;

import org.springframework.stereotype.Component;

import java.util.List;

@Component
public class ConsonantAlphabetProvider implements AlphabetProvider {

    @Override
    public List<String> provideAlphabet() {
        return List.of(
                "m̥", "m", "ɱ", "n̼", "n̥", "n", "ɳ̊", "ɳ", "ɲ̊", "ɲ", "ŋ̊", "ŋ", "ɴ̥", "ɴ",
                "p", "b", "p̪", "b̪", "t̼", "d̼", "t̪", "d̪", "t", "d", "ʈ", "ɖ", "c", "ɟ", "k", "g", "q", "ɢ", "ʡ", "ʔ",
                "t̪s̪", "d̪z̪", "ts", "dz", "t̠ʃ", "d̠ʒ", "tʂ", "dʐ", "tɕ", "dʑ",
                "pɸ", "bβ", "p̪f", "b̪v", "t̪θ", "d̪ð", "tɹ̝̊", "dɹ̝", "t̠ɹ̠̊", "d̠ɹ̠˔", "cç", "ɟʝ", "kx", "ɡɣ", "qχ", "ɢʁ", "ʡʜ", "ʡʢ", "ʔh",
                "s", "z", "ʃ", "ʒ", "ʂ", "ʐ", "ɕ", "ʑ",
                "ɸ", "β", "f", "v", "θ̼", "ð̼", "θ", "ð", "θ̠", "ð̠", "ɹ̠̊˔", "ɹ̠˔", "ɻ̊˔", "ɻ˔", "ç", "ʝ", "x", "ɣ", "χ", "ʁ", "ħ", "ʕ", "h", "ɦ",
                "β̞", "ʋ", "ð̞", "ɹ", "ɹ̠", "ɻ", "j", "ɰ", "ʁ̞", "ʔ̞",
                "ⱱ̟", "ⱱ", "ɾ̼", "ɾ̥", "ɾ", "ɽ̊", "ɽ", "ɢ̆", "ʡ̆",
                "ʙ̥,", "ʙ", "r̥", "r", "r̠", "ʀ̥", "ʀ", "ʜ", "ʢ",
                "tɬ", "dɮ", "tꞎ", "ɟʎ̝", "ɡʟ̝",
                "ɬ", "ɮ", "ꞎ", "ʎ̝", "ʟ̝",
                "l̪", "l", "l̠", "ɭ", "ʎ", "ʟ", "ʟ̠",
                "ɺ̥", "ɺ", "ʎ̆", "ʟ̆",
                "k͡p", "ɡ͡b",
                "ŋ͡m",
                "ʍ", "w", "ɥ",
                "ɧ", "ɫ",
                "pʼ", "tʼ", "ʈʼ", "cʼ", "kʼ",
                "qʼ", "ʡʼ",
                "fʼ", "θʼ", "sʼ", "ʃʼ", "ʂʼ",
                "ɕʼ", "xʼ", "χʼ",
                "tsʼ", "t̠ʃʼ", "ʈʂʼ", "kxʼ", "qχʼ",
                "ɬʼ", "tɬʼ", "cʎ̝̊ʼ", "kʟ̝̊ʼ",
                "kʘ", "kǀ", "kǃ", "kǂ", "kǁ",
                "ɓ", "ɗ", "ʄ", "ɠ", "ʛ"
        );
    }

}
